package com.hackathon2019.padeitha.utils

import com.hackathon2019.padeitha.domain.responses.news.New


fun getSampleList(): ArrayList<String> {
    var sampleList: ArrayList<String> = ArrayList()
    sampleList.add("https://image.shutterstock.com/image-photo/yangon-myanmar-jan-25-pakistan-600w-93574456.jpg")
    sampleList.add("b")
    sampleList.add("https://cdn.pixabay.com/photo/2015/05/29/09/51/ringelspinner-789125__340.jpg")
    sampleList.add("a")
    sampleList.add("b")
    sampleList.add("a")
    sampleList.add("a")
    sampleList.add("b")
    sampleList.add("a")
    return sampleList
}

fun getSampleNewsList(): ArrayList<New> {
    var sampleList: ArrayList<New> = ArrayList()

    val item1 = New(
        "နိုင်ငံတော်အဆင့်သတင်း",
    "အောက်တိုဘာ ၁၅၊ ၂၀၁၉",
    "နိုင်ငံတော်၏ အတိုင်ပင်ခံ ပုဂ္ဂိုလ်   မြို့ကြီးရေလှောင်တမံသို့ ရောက်ရှိ",
    "နိုင်ငံတော်၏ အတိုင်ပင်ခံ ပုဂ္ဂိုလ် သည်  မေလ ၁၇ ရက် နံနက် ၁၁ နာရီခွဲအချိန်တွင် မြို့ကြီးရေလှောင်တမံသို့ ရောက်ရှိရာ စိုက်ပျိုးရေး၊ မွေးမြူရေးနှင့် ဆည်မြောင်းဝန်ကြီးဌာန ပြည်ထောင်စုဝန်ကြီး ဒေါက်တာအောင်သူ နှင့် တာဝန်ရှိသူများက ကြိုဆိုကြသည်။ \nယင်းနောက် နိုင်ငံတော်၏အတိုင်ပင်ခံပုဂ္ဂိုလ်နှင့်အဖွဲ့သည် စက်လှေဖြင့် တမံအတွင်း ရေသိုလှောင် ထားရှိမှုနှင့် ပတ်ဝန်းကျင် စိမ်းလန်းစိုပြည်ရေး ဆောင်ရွက်ထားရှိမှုကို လိုက်လံကြည့်ရှုသည်။ ထိုသို့ လိုက်လံကြည့်ရှုစဉ် ပြည်ထောင်စု ဝန်ကြီး ဒေါက်တာ အောင်သူနှင့် ညွှန်ကြားရေးမှူးချုပ် ဦးကျော်မြင့်လှိုင် တို့က မြို့ကြီး ရေလှောင်တမံဆိုင်ရာ အချက်အလက်များ၊ စိုက်ပျိုးရေ ဖြန့်ဝေပေးနေမှု စပ်လျဉ်း၍ ရှင်းလင်းတင်ပြကြသည်။ \nထို့နောက် နိုင်ငံတော်၏အတိုင်ပင်ခံပုဂ္ဂိုလ်သည် မော်တော်ယာဉ်များဖြင့် တမံပတ် လမ်းအတိုင်း တမံ တည်ဆောက်ထားမှု အခြေအနေနှင့် ရေယူ အဆောက်အဦအား လိုက်လံကြည့်ရှုရာ ပြည်ထောင် စုဝန်ကြီးနှင့် တာဝန်ရှိသူများက စိုက်ပျိုးရေပေးဝေနေမှု၊ ရေသိုလှောင် ထားရှိမှုနှင့် တမံအခြေ အနေတို့ကို ရှင်းလင်းတင်ပြကြသည်။",
    "https://cdn.pixabay.com/photo/2016/09/07/04/22/coffee-beans-1650788__340.jpg",
    "")

    val item2 = New("လယ်ယာကဏ္ဍ",
    "အောက်တိုဘာ ၁၄၊ ၂၀၁၉",
    "လယ်သမားများ၏အခက်အခဲများ",
    "လောက်ကောင်ငယ်များကို ကနဦးတွင် ရွက်မွှာများအတွင်း ထိုးဖောက်ဝင်ရောက်ပြီး အတွင်းသားတစ်ရှူးများကို စားပြီး အရွက်ပေါ်တွင် အညိုရောက် အကွက်များကို ဖြစ်စေသည်။ \nနောက်ပိုင်းအဆင့်များတွင် လောက်ကောင်များသည် ရွက်မွှာများကို အတူတစ်ကွ ပေါင်းဆက်လိုက်ပြီး ၎င်းတို့ကို စားသောက်ကာ အတွင်းပိုင်းတွင် ခေါက်လျက် နေထိုင်သည်။ \nဆိုးဝါးစွာကျရောက်သော မြေပဲခင်းကို အဝေးကကြည့်လျှင် မီးလောင်နေသကဲ့သို့ ဖြစ်နေသည်။",
    "https://cdn.pixabay.com/photo/2015/05/29/09/51/ringelspinner-789125__340.jpg",
    "b")

    sampleList.add(item1)
    sampleList.add(item2)

    return sampleList
}




val IMAGE_URL = "http://159.89.198.182/"
val PERMISSIONS_REQUEST_CALL_PHONE = 1234